[
  {
    "id": 1770901833993,
    "slug": "panduan-dasar-jaringan-komputer",
    "title": "Panduan Dasar Jaringan Komputer",
    "excerpt": "Jaringan komputer adalah sistem yang menghubungkan dua atau lebih perangkat agar dapat saling berbagi data, sumber daya, dan layanan. Panduan ini membahas pengertian jaringan, jenis-jenis jaringan, perangkat jaringan, konsep IP address, serta contoh konfigurasi sederhana.",
    "content": "Pengantar jaringan komputer\nJaringan komputer memungkinkan perangkat seperti komputer, server, dan printer saling terhubung untuk bertukar informasi secara efisien. Dengan jaringan, komunikasi data menjadi lebih cepat dan terpusat.\n\nJenis-jenis jaringan komputer\nBerdasarkan jangkauan wilayahnya, jaringan komputer dibagi menjadi beberapa jenis utama.\n\nLAN (Local Area Network)\nLAN digunakan pada area kecil seperti rumah, sekolah, atau kantor. Jaringan ini biasanya memiliki kecepatan tinggi dan dikelola secara lokal.\n\nMAN (Metropolitan Area Network)\nMAN mencakup area yang lebih luas seperti satu kota. Biasanya digunakan oleh instansi besar atau penyedia layanan internet.\n\nWAN (Wide Area Network)\nWAN mencakup wilayah yang sangat luas antar kota atau negara. Internet adalah contoh terbesar dari WAN.\n\nPerangkat utama dalam jaringan\nAgar jaringan dapat berjalan dengan baik, dibutuhkan beberapa perangkat pendukung.\n\nRouter\nRouter berfungsi menghubungkan beberapa jaringan yang berbeda dan mengatur lalu lintas data.\n\nSwitch\nSwitch digunakan untuk menghubungkan banyak perangkat dalam satu jaringan lokal (LAN).\n\nAccess Point\nAccess Point memungkinkan perangkat terhubung ke jaringan menggunakan koneksi nirkabel (WiFi).\n\nKonsep dasar IP Address\nIP Address adalah alamat unik yang digunakan untuk mengidentifikasi perangkat dalam jaringan. IP address terbagi menjadi IPv4 dan IPv6.\n\nContoh format IP Address IPv4 adalah sebagai berikut.\n\n192.168.1.1\n\n\nSetiap bagian angka dipisahkan oleh tanda titik dan memiliki rentang nilai tertentu.\n\nContoh konfigurasi IP Address sederhana (Windows)\nBerikut contoh perintah untuk melihat konfigurasi IP pada sistem operasi Windows.\n\nipconfig\n\n\nContoh konfigurasi IP Address pada Linux.\n\nifconfig\n\n\natau\n\nip addr\n\n\nPengujian koneksi jaringan\nUntuk memastikan jaringan berjalan dengan baik, kita dapat melakukan pengujian koneksi menggunakan perintah ping.\n\nping google.com\n\n\nJika koneksi berhasil, maka akan muncul balasan (reply) dari server tujuan.\n\nKesimpulan\nJaringan komputer merupakan fondasi utama dalam sistem teknologi informasi modern. Dengan memahami konsep dasar jaringan, jenis jaringan, perangkat pendukung, dan cara pengujian koneksi, kita dapat membangun serta mengelola jaringan dengan lebih efektif.",
    "files": [],
    "date": "2026-02-12"
  }
]
